OpenFOAM-5/chapter11/cyclone-DPMFoam/Allrun
#!/bin/sh

cd ${0%/*} || exit 1

. $WM_PROJECT_DIR/bin/tools/RunFunctions


blockMesh

snappyHexMesh -overwrite

decomposePar

mpirun -np 8 DPMFoam -parallel > log 

reconstructPar
